# Условие задания КИМ 14 (Умскул):
'''
Значение выражения "1234^1234 * 2345^2345 + 57^5557 * 4321^4321" записали в системе счисления с основанием 18.
Определите количество комбинаций цифр "*#" в этой записи, где:
символ "*" - любая цифра от 0 до 9,
символ "#" - любая цифра от "A" до "H".
'''

dct = {10: "A", 11: "B", 12: "C", 13: "D", 14: "E", 15: "F", 16: "G", 17: "H"}


def to_18(n):
    res = ""
    while n > 0:
        r = n % 18
        if r < 10:
            res += str(r)
        else:
            res += dct[r]
        n //= 18
    return res[::-1]


a = (1234 ** 1234) * (2345 ** 2345) + (57 ** 5557) * (4321 ** 4321)
a = to_18(a)

res = 0
for x1 in range(10):
    for x2 in "ABCDEFGH":
        comb = str(x1) + x2
        res += a.count(comb)
print(res)
